REPOSITORIO/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    //- Set patchGroups for constraint patches
    #includeEtc "caseDicts/setConstraintTypes"


    entrada
    {
        type            fixedValue;
        value           uniform (4 0 0);
    }

  
    salida
    {
        type            inletOutlet;
        inletValue      $internalField;
        value           $internalField;
    }

    tobera
    {
        type            noSlip;
    }

    tubo
    {
        type            noSlip;
    }

    pre_tubo
    {
        type            noSlip;
    }

    flexible
    {
        type            noSlip;
    }
}

// ************************************************************************* //
