REPOSITORIO/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

out_geometria_orientada.stl
{
  // How to obtain raw features (extractFromFile || extractFromSurface)
  extractionMethod extractFromSurface;
  extractFromSurfaceCoeffs
    {
      // Mark edges whose adjacent surface normals are at an angle less
      // than includedAngle as features
      // - 0 : selects no edges
      // - 180: selects all edges
      includedAngle 100;  // con 150grados habia secciones triangulares seleccionadas del stl que no correspondian
    }
  // Write options
  // Write features to obj format for postprocessing
  writeObj yes;
}





// ************************************************************************* //
